uat_chat/Catalogs/уатСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>уатСерииНоменклатуры</Name>
			<Comment>Агрегаты (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель агрегата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

uat_chat/Catalogs/уатСерииНоменклатуры/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт; // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование серии по значениям реквизитов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование() Экспорт
	ТаблицаНастроек = Константы.уатНастройкаФормированияНаименованийАгрегатов.Получить().Получить();
	Если ТаблицаНастроек = Неопределено ИЛИ НЕ ТаблицаНастроек.Количество() Тогда		
		СтрокаНаименование = СформироватьНаименованиеОбычное();
	Иначе
		СтрокаНаименование = СформироватьНаименованиеПоНастройкам();
	КонецЕсли;	
	
	Возврат СтрокаНаименование;
КонецФункции

Функция СформироватьНаименованиеПоНастройкам() Экспорт
	ТаблицаНастроек = Константы.уатНастройкаФормированияНаименованийАгрегатов.Получить().Получить();
	Если ТаблицаНастроек = Неопределено ИЛИ НЕ ТаблицаНастроек.Количество() Тогда
		Возврат "";
	КонецЕсли;
	
	ПредставлениеНаименования = "";
	ЕстьЗаполненныеПоля = Ложь;
	Для каждого ТекНастройка ИЗ ТаблицаНастроек цикл
		Попытка
			Если ТекНастройка.Поле = "[ГоденДо]" Тогда
				Если ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда
					Продолжить;
				КонецЕсли;
				мСтрока = Формат(ЭтотОбъект[СтрЗаменить(СтрЗаменить(ТекНастройка.Поле,"[",""),"]","")], "ДФ=dd.MM.yyyy");
			Иначе
				мСтрока = ЭтотОбъект[СтрЗаменить(СтрЗаменить(ТекНастройка.Поле,"[",""),"]","")];
			КонецЕсли;
			Если ЗначениеЗаполнено(мСтрока) тогда
				ЕстьЗаполненныеПоля = Истина;
			КонецЕсли;
		Исключение
			мСтрока = ТекНастройка.Поле;
		КонецПопытки;
		ПредставлениеНаименования = ПредставлениеНаименования + мСтрока;
	КонецЦикла;
	Если ЕстьЗаполненныеПоля тогда
		Возврат ПредставлениеНаименования;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции

Функция СформироватьНаименованиеОбычное() Экспорт
	Если ТипАгрегата = Справочники.уатТипыАгрегатов.Аккумулятор Тогда
		СтрокаНаименование = "Аккумулятор ";
	ИначеЕсли ТипАгрегата = Справочники.уатТипыАгрегатов.Шина Тогда	
		СтрокаНаименование = "Шина ";
	ИначеЕсли ЗначениеЗаполнено(ТипАгрегата) тогда
		СтрокаНаименование = "" + ТипАгрегата.Наименование + " ";
	Иначе
		СтрокаНаименование = "Агрегат ";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(СерийныйНомер) Тогда
		СтрокаНаименование = СтрокаНаименование + "с/н: " + СерийныйНомер + ", ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Модель) Тогда
		СтрокаНаименование = СтрокаНаименование + Модель.Наименование + ", ";
	КонецЕсли;
	
	Если Прав(СтрокаНаименование, 2) = ", " Тогда
		СтрокаНаименование = Лев(СтрокаНаименование, СтрДлина(СтрокаНаименование) - 2);
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаНаименование) Тогда
		СтрокаНаименование = "<Свойства не назначены>";
	КонецЕсли;
	
	Возврат СтрокаНаименование;
КонецФункции

// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	уатОбщегоНазначения.уатПроверкаПравПередЗаписьюВСправочниках(ЭтотОбъект, Отказ, , Права);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
	Права = глПраваУАТ;
#КонецЕсли
